//이것은 첫 번째 버전으로 가장 간단한 버전이다.
//상대가 무작위로 선택할 수 없으면 무한 반복을 의해 for(;;),break만 사용한다.

#include<stdio.h>
int main(){
    int user;
    int computer;


    printf("================================================================\n");
    printf("                    가위바위보 토너먼트                    \n");
    printf("================================================================\n");
    printf("\n");
    printf("[대진표]\n");
    printf("----------------------------------------------------------------\n");
    printf("8강\n");
    printf("[1] 플레이어  vs   [2] A\n");
    printf("[3] B  vs   [4] C\n");
    printf("[5] D  vs   [6] E\n");
    printf("[7] F  vs   [8] G\n");
    printf("----------------------------------------------------------------\n");
    printf("당신은 [1] 플레이어입니다.\n");
    printf("----------------------------------------------------------------\n");
    printf("\n");
    printf("\n");
    


    for(;;){
        printf("================================================================\n");
        printf("8강\n");
        printf("[1] 플레이어 -- 상대: A\n");
        printf("================================================================\n");
        printf("1: 가위      2: 바위      3: 보\n");

            for(;;){
                printf("선택>");
                scanf("%d",&user);
                
                if(user >= 1 && user <= 3)
                    break;

                printf("1,2,3 중에서 입력해주세요.\n");
            }

            computer = 3;

            if (user == 1){
                printf("나: 가위    A: 보\n");
            }
            else if (user == 2){
                printf("나: 바위    A: 보\n");
            }
            else if (user == 3){
                printf("나: 보    A: 보\n");
            }


            if(user == computer){
                printf("비겼습니다. 재경기!\n");
                continue;
            }
            else if((user == 1 && computer == 3) || (user == 2 && computer == 1) || (user == 3 && computer == 2)){
                printf("이겼습니다! 4강 진출!\n");
                break;
            }
            else{
                printf("졌습니다...\n");
                printf("\n");
                printf("\n");
                printf("=================================================================\n");
                printf("아쉽습니다! 다음 기회에 도전해주세요!\n");
                printf("=================================================================\n");
                return 0;;
            }
        }
        
    for(;;){
        printf("\n");
        printf("\n");
        printf("================================================================\n");
        printf("4강\n");
        printf("[1] 플레이어 -- 상대: C\n");
        printf("================================================================\n");
        printf("1: 가위      2: 바위      3: 보\n");

        for(;;){
            printf("선택>");
            scanf("%d",&user);
                
            if(user >= 1 && user <= 3)
                break;

            printf("1,2,3 중에서 입력해주세요.\n");
        }

        computer = 2;

        if (user == 1){
            printf("나: 가위    C: 보\n");
        }
        else if (user == 2){
            printf("나: 바위    C: 보\n");
        }
        else if (user == 3){
            printf("나: 보    C: 보\n");
        }


        if(user == computer){
            printf("비겼습니다. 재경기!\n");
            continue;
        }
        else if((user == 1 && computer == 3) || (user == 2 && computer == 1) || (user == 3 && computer == 2)){
            printf("이겼습니다! 결승 진출!\n");
            break;
        }
        else{
            printf("졌습니다...\n");
            printf("\n");
            printf("\n");
            printf("=================================================================\n");
            printf("아쉽습니다! 다음 기회에 도전해주세요!\n");
            printf("=================================================================\n");
            return 0;;
        }

    }

    for(;;){
        printf("\n");
        printf("\n");
        printf("================================================================\n");
        printf("결승\n");
        printf("[1] 플레이어 -- 상대: G\n");
        printf("================================================================\n");
        printf("1: 가위      2: 바위      3: 보\n");

            for(;;){
                printf("선택>");
                scanf("%d",&user);
                
                if(user >= 1 && user <= 3)
                    break;

                printf("1,2,3 중에서 입력해주세요.\n");
            }

            computer = 1;

            if (user == 1){
                printf("나: 가위    G: 보\n");
            }
            else if (user == 2){
                printf("나: 바위    G: 보\n");
            }
            else if (user == 3){
                printf("나: 보    G: 보\n");
            }


            if(user == computer){
                printf("비겼습니다. 재경기!\n");
                continue;
            }
            else if((user == 1 && computer == 3) || (user == 2 && computer == 1) || (user == 3 && computer == 2)){
                printf("이겼습니다!\n");
                printf("=================================================================\n");
                printf("축하합니다! 우승하셨습니다!\n");
                printf("=================================================================\n");
                break;
            }
            else{
                printf("졌습니다...\n");
                printf("\n");
                printf("\n");
                printf("=================================================================\n");
                printf("아쉽습니다! 다음 기회에 도전해주세요!\n");
                printf("=================================================================\n");
                return 0;;
            }

        }    
        return 0;
    }

